Revit 2027 API
DialogBoxData.OverrideResult Method
 Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool OverrideResult(
	int result
)
Public Function OverrideResult (
	result As Integer
) As Boolean
public:
bool OverrideResult(
	int result
)
member OverrideResult :
        result : int -> bool
Parameters
result Int32
 The result code you wish the Revit dialog to return.
Return Value
Boolean
 Returns true if the result code was accepted.
See Also
Reference
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace